#### WireframeBuilder Members

---

|  |
| --- |
| WireframeBuilder Class   Constructors   Methods   Properties   See Also |

The  WireframeBuilder  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | WireframeBuilder | Default constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddCurve | Add a curve to the shape representation stored in this WireframeBuilder. |
| Public method | AddPoint | Add a point to the shape representation stored in this WireframeBuilder. |
| Public method | Dispose | (Inherited from  ShapeBuilder  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Reset | Clears the accumulated geometry. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method Static member | ValidateCurve | Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve(). |
| Public method Static member | ValidatePoint | Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ShapeBuilder  .) |

# See Also

WireframeBuilder Class

Autodesk.Revit.DB Namespace